# Дана последовательность из N целых чисел и число K. 
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) 
# на K элементов вправо, K – положительное число.

# list = [1, 2, 3, 4, 5]
# number = int(input('Введите число, на которое сдвинем массив: '))
# i = 0
# while i < number:
#     list.insert(0, list[len(list)-1])
#     list.pop(len(list)-1)
#     i+=1
# print(list)



# Напишите программу для печати всех уникальных значений в словаре.

# dict = {}
# unique = set()
# dict['g'] = 'hello'
# dict['f'] = 'hello'
# dict['h'] = 'python'
# dict['d'] = 'world'
# dict['s'] = 'world'
# dict['a'] = 'python'

# for i in dict:
#     for key in i:
#         unique.add(i[key])
# print(unique)

